first_routs/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "artist_id" = $1 WHERE "artworks"."id" = $2  [["artist_id", 2], ["id", 4]]
---
  def update
    artwork = Artwork.find(params[:id])
    if artwork.update_attributes(artwork_params)