first_routs/app/controllers/users_controller.rb

  def show
    user = User.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    user = User.find_by_id(params[:id])
    if user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "steve"], ["email", "steve2@aol.com"], ["updated_at", "2018-09-10 21:51:13.663463"], ["id", 2]]

  def destroy
    user = User.find_by_id(params[:id])
    if user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]